In [1]:
import pandas as pd
import numpy as np
import openpyxl as pxl
import tabula
import os
import lxml

Grabbing Data

In [2]:
x = pd.read_excel("Test Sheet.xlsx")

c:\Users\Gaku Tokusumi\AppData\Local\Programs\Python\Python310\lib\site-packages\openpyxl\styles\stylesheet.py:226: UserWarning: Workbook contains no default style, apply openpyxl's default
  warn("Workbook contains no default style, apply openpyxl's default")

In [3]:
x.head()

,Room,Room Type,Floor,Employee Assigned,Room Points,Front Desk Status,Housekeeping Status,Room Status,Pre-Registered,Service Type,...,Last Cleaned,Points Adjustment,Employee Total Rooms,Employee Total Points,Last Name,First Name,Action,Scheduled Return Time,Cleaning Start Time,Cleaning End Time
0,304,GK,03rd Floor,Johana,3,Occupied,Occupied,Dirty,NO,Light,...,2023-03-09 15:32:00,0.0,24,108,Gupta,Mayank,NaN,NaN,NaN,NaN
1,305,GK,03rd Floor,Johana,6,Vacant,Vacant,Dirty,NO,Check-Out,...,2023-03-08 13:37:00,0.0,24,108,NaN,NaN,NaN,NaN,NaN,NaN
2,306,GK,03rd Floor,Johana,3,Occupied,Occupied,Dirty,NO,Light,...,2023-03-08 12:23:00,0.0,24,108,Izidoro Ferreira da Costa,Andre,NaN,NaN,NaN,NaN
3,307,DCGQQ,03rd Floor,Johana,7,Occupied,Occupied,Dirty,NO,Check-Out,...,2023-03-09 15:30:00,0.0,24,108,Bellissimo,Cinzia,NaN,NaN,NaN,NaN
4,309,GK,03rd Floor,Johana,3,Occupied,Occupied,Dirty,NO,Light,...,2023-03-09 12:57:00,0.0,24,108,Brennan,Nicholas,NaN,NaN,NaN,NaN

In [5]:
 x.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 128 entries, 0 to 127
Data columns (total 31 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Room                   128 non-null    int64
 1   Room Type              128 non-null    object
 2   Floor                  128 non-null    object
 3   Employee Assigned      128 non-null    object
 4   Room Points            126 non-null    float64
 5   Front Desk Status      128 non-null    object
 6   Housekeeping Status    128 non-null    object
 7   Room Status            128 non-null    object
 8   Pre-Registered         128 non-null    object
 9   Service Type           128 non-null    object
 10  VIP                    4 non-null      object
 11  Next Arrival Date      7 non-null      datetime64[ns]
 12  Next Arrival Time      1 non-null      object
 13  Arrival Date           94 non-null     datetime64[ns]
 14  Arrival Time           0 non-null      float64
 15  Departure Date         94 non-null     datetime64[ns]
 16  Departure Time         1 non-null      object
 17  Turndown Time          0 non-null      float64
 18  Cleaning Time          0 non-null      float64
 19  Room Type Name         128 non-null    object
 20  Room Description       128 non-null    object
 21  Last Cleaned           126 non-null    datetime64[ns]
 22  Points Adjustment      128 non-null    int64
 23  Employee Total Rooms   128 non-null    int64
 24  Employee Total Points  128 non-null    int64
 25  Last Name              94 non-null     object
 26  First Name             94 non-null     object
 27  Action                 6 non-null      object
 28  Scheduled Return Time  0 non-null      float64
 29  Cleaning Start Time    4 non-null      object
 30  Cleaning End Time      0 non-null      float64
dtypes: datetime64[ns](4), float64(6), int64(4), object(17)
memory usage: 31.1+ KB

In [6]:
len(x)

128

In [11]:
x[['Room Type','Room Points','Service Type']]

    Room Type       VIP  Room Points Service Type
0          GK       NaN          6.0    Check-Out
1          GK       NaN          6.0    Check-Out
2          GK       NaN          6.0    Check-Out
3          GK       NaN          6.0    Check-Out
4          GK       NaN          6.0    Check-Out
..        ...       ...          ...          ...
123       GQQ       NaN          4.0        Light
124       GQQ       NaN          4.0        Light
125        GK       NaN          3.0        Light
126      STE2  Heads Up          8.0        Light
127      STE2       NaN          8.0        Light

[128 rows x 4 columns]

Cleaing Data

In [4]:
df = x[['Room Type','Employee Assigned','Room Points','Service Type','Action']]

In [5]:
df

    Room Type Employee Assigned  Room Points Service Type Action
0          GK            Johana            3        Light    NaN
1          GK            Johana            6    Check-Out    NaN
2          GK            Johana            3        Light    NaN
3       DCGQQ            Johana            7    Check-Out    NaN
4          GK            Johana            3        Light    NaN
..        ...               ...          ...          ...    ...
133       GQQ              Emir            4        Light    NaN
134       GQQ              Emir            4        Light    NaN
135       GQQ              Emir            7    Check-Out    NaN
136       GQQ              Emir            4        Light    NaN
137        GK              Emir            3        Light    NaN

[138 rows x 5 columns]

In [40]:
names = df['Employee Assigned'].unique()

In [30]:
type(names)

numpy.ndarray

In [31]:
names = np.ndarray.tolist(names)

In [32]:
type(names)

list

Set index

In [33]:
df.set_index('Employee Assigned',inplace=True)

In [34]:
df

                  Room Type  Room Points Service Type Action
Employee Assigned
Johana                   GK          6.0    Check-Out    NaN
Johana                   GK          6.0    Check-Out    NaN
Johana                   GK          6.0    Check-Out    NaN
Johana                   GK          6.0    Check-Out    NaN
Johana                   GK          6.0    Check-Out    NaN
...                     ...          ...          ...    ...
Julio                   GQQ          4.0        Light    NaN
Julio                   GQQ          4.0        Light    NaN
Julio                    GK          3.0        Light    NaN
Julio                  STE2          8.0        Light    NaN
Julio                  STE2          8.0        Light    NaN

[128 rows x 4 columns]

Adding names to excel sheet

In [35]:
wb = pxl.Workbook()

In [36]:
sheet = wb.active

Working function
need to find a way to add workload

In [51]:
from openpyxl.utils.dataframe import dataframe_to_rows
lstname = pd.DataFrame(np.ndarray.tolist(names))
rows = dataframe_to_rows(lstname)
for r_idx,row in enumerate(rows,1):
    for c_idx,value in enumerate(row,1):
        sheet.cell(row=r_idx,column=c_idx,value=value)
wb.save("testbook.xlsx")

In [46]:
lstname

           0
0     Johana
1  Alexander
2   Cheyenne
3       Shae
4     Nestor
5       Emir
6    Mariana
7    Jasmine
8      Julio
9   Andrea A

Calculating workload

In [57]:
df

    Room Type Employee Assigned  Room Points Service Type Action
0          GK            Johana          6.0    Check-Out    NaN
1          GK            Johana          6.0    Check-Out    NaN
2          GK            Johana          6.0    Check-Out    NaN
3          GK            Johana          6.0    Check-Out    NaN
4          GK            Johana          6.0    Check-Out    NaN
..        ...               ...          ...          ...    ...
123       GQQ             Julio          4.0        Light    NaN
124       GQQ             Julio          4.0        Light    NaN
125        GK             Julio          3.0        Light    NaN
126      STE2             Julio          8.0        Light    NaN
127      STE2             Julio          8.0        Light    NaN

[128 rows x 5 columns]

Room type

In [6]:
roomCount = {'King Checkout':0,'King Stayover':0,'Queen Checkout':0,'Queen Stayover':0}
# roomCountPrime = {} Use to create dictionary for all room types

In [7]:
x = df.sort_values(by='Employee Assigned')

In [59]:
x

   Room Type Employee Assigned  Room Points Service Type Action
63       GQQ         Alexander          4.0        Light    NaN
67      SGQQ         Alexander          7.0        Light    NaN
66       GQQ         Alexander          4.0        Light    NaN
65        GK         Alexander          3.0        Light    NaN
64       GQQ         Alexander          4.0        Light    NaN
..       ...               ...          ...          ...    ...
75       GQQ              Shae          4.0        Light    NaN
74       GQQ              Shae          4.0        Light    NaN
73       GQQ              Shae          4.0        Light    NaN
68        GK              Shae          3.0        Light    NaN
17     ASJQQ              Shae          7.0    Check-Out    NaN

[128 rows x 5 columns]

slices dataframe by employee

In [8]:
cleaned = dict(tuple(x.groupby("Employee Assigned")))

In [35]:
for i in list(cleaned):
    print(i)

Alexander
Cheyenne
Emir
Float Board
Hung Board
Johana
Mariana
Shae

Way to get names

In [11]:
test = [i for i in cleaned]
print(test)

['Alexander', 'Cheyenne', 'Emir', 'Float Board', 'Hung Board', 'Johana', 'Mariana', 'Shae']

In [23]:
df = pd.DataFrame(index=test,columns=["KING","QUEEN"])

In [24]:
df

            KING QUEEN
Alexander    NaN   NaN
Cheyenne     NaN   NaN
Emir         NaN   NaN
Float Board  NaN   NaN
Hung Board   NaN   NaN
Johana       NaN   NaN
Mariana      NaN   NaN
Shae         NaN   NaN

In [29]:
for i in len(df):
    print(df.loc[i])

TypeError: 'int' object is not iterable

In [37]:
dictCount=[('Alexander',
  {'King Checkout': 4,
   'King Stayover': 3,
   'Queen Checkout': 3,
   'Queen Stayover': 3}), 
   ('test',
    {'King Checkout': 2,
   'King Stayover': 1,
   'Queen Checkout': 5,
   'Queen Stayover': 7})]
headerValues = ['King Checkout','King Stayover','Queen Checkout','Queen Stayover']

In [40]:
data = pd.DataFrame(index=[i[0] for i in dictCount],columns= headerValues)

In [44]:
data.iloc[0].loc["King Checkout"] = 1

In [ ]:
for i in range(len(dictCount)):
    for j in range(len(headerValues)):
        data.iloc[]

In [16]:
print(test)

['Alexander', 'Cheyenne', 'Emir', 'Float Board', 'Hung Board', 'Johana', 'Mariana', 'Shae']

In [9]:
alex = cleaned['Alexander']

In [66]:
alex

   Room Type Employee Assigned  Room Points Service Type            Action
63       GQQ         Alexander          4.0        Light               NaN
67      SGQQ         Alexander          7.0        Light               NaN
66       GQQ         Alexander          4.0        Light               NaN
65        GK         Alexander          3.0        Light               NaN
64       GQQ         Alexander          4.0        Light               NaN
62       DGK         Alexander          3.0        Light               NaN
7         GK         Alexander          NaN    Check-Out               NaN
8         GK         Alexander          6.0    Check-Out               NaN
9        GQQ         Alexander          7.0    Check-Out  Cleaning Started
10       GQQ         Alexander          7.0    Check-Out               NaN
11        GK         Alexander          6.0    Check-Out               NaN
12      STE1         Alexander          9.0    Check-Out               NaN

In [12]:
# Change else statement to switch case instead
# Change the counts for suites 
count = roomCount
FullCount= []
kings = ['GK','AGK','B5GK','DGK','STK']
queens = ['GQQ','GTT','STB','DCGQQ','ASJQQ']
suitesK = ['SGK','STE1']
SuitesS = 'STE2'
suitesQ = ['SGQQ','ASGQQ']
for i in range(len(alex['Room Points'])):
    points = alex["Room Points"].iloc[i] 
    room = alex['Room Type'].iloc[i]
    service = alex['Service Type'].iloc[i]
    if pd.isna(alex['Room Points'].iloc[i]) == True:
        if room in kings:
            if service == 'Check-Out':
                count['King Checkout'] = count['King Checkout'] + 1
            else:
                count['King Stayover'] = count['King Stayover'] + 1
        if room in queens:
            if service == 'Check-Out':
                count['Queen Checkout'] = count['Queen Checkout'] + 1
            else:
                count['Queen Stayover'] = count['Queen Stayover'] + 1
        if room in suitesK:
            if service == 'Check-Out':
                count['King Checkout'] = count['King Checkout'] +1 
                count['King Stayover'] = count['King Stayover'] +1
            else:
                count['King Checkout'] = count['King Checkout'] +1 
        if room == SuitesS:
            if service == 'Check-Out':
                count['King Checkout'] = count['King Checkout'] + 2
            else:
                count['King Checkout'] = count['King Checkout'] +1 
        if room in suitesQ:
            if service == 'Check-Out':
                count['Queen Checkout'] = count['Queen Checkout'] +1
                count['king Stayover'] = count['King Stayover'] + 1

    #   Write code to check room type and service type
    else:
        if points == 3:
            count['King Stayover'] = count['King Stayover'] + 1
        if points == 4:
            count['Queen Stayover'] = count['Queen Stayover'] + 1
        if points == 6:
            count['King Checkout'] = count['King Checkout'] + 1
        if points == 7:
            count['Queen Checkout'] = count['Queen Checkout'] + 1
        if points == 9:
            count['King Checkout'] = count['King Checkout'] + 1
            count['King Stayover'] = count['King Stayover'] + 1
        if points == 10:
            count['King Checkout'] = count['King Checkout'] + 1
            count['Queen Stayover'] = count['Queen Stayover'] +1
        if points == 12:
            count['King Checkout'] = count['King Checkout'] + 2 
FullCount.append(('Alexander',count))

In [80]:
pd.isna(alex['Room Points'].iloc[6])

True

In [13]:
FullCount

[('Alexander',
  {'King Checkout': 4,
   'King Stayover': 3,
   'Queen Checkout': 3,
   'Queen Stayover': 3})]

In [15]:
print([i[0] for i in FullCount])

['Alexander']

In [16]:
testdf = pd.DataFrame(index=test)

In [18]:
len(testdf)

10

In [19]:
testdf

Empty DataFrame
Columns: []
Index: [Alexander, Andrea A, Cheyenne, Emir, Jasmine, Johana, Julio, Mariana, Nestor, Shae]